
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 4 to change, 2 to destroy.</code></pre>

* Create
  * module.ccpay-bulkscanning-payment-database-v15.terraform_data.trigger_password_reset
* Update
  * azurerm_api_management_subscription.exela_supplier_subscription
  * azurerm_api_management_subscription.fee_pay_team_bulk_scan_subscription
  * azurerm_api_management_subscription.iron_mountain_supplier_subscription
  * module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy
* Replace
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.exela_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "exela_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/6dba11e4-d5da-4ca9-ba42-0a965df14a53"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.fee_pay_team_bulk_scan_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "fee_pay_team_bulk_scan_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/d76fb7ae-abfe-438c-a7d3-d74764ca08b4"
        # (10 unchanged attributes hidden)
    }

  # azurerm_api_management_subscription.iron_mountain_supplier_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "iron_mountain_supplier_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/259cde55-4006-4fd2-b534-416522123483"
        # (10 unchanged attributes hidden)
    }

  # module.ccpay-bulkscanning-payment-database-v15.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

  # module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "api_policy" {
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/apis/bulk-scanning-payment-api"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<inbound>
          - 		<base />
          - 		<choose>
          - 			<when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter &lt; DateTime.Now || context.Request.Certificate.NotBefore &gt; DateTime.Now || !(new string[] {&quot;A78ED211FD9CE9DE2EEC47FD1A87F40CE0F4A1A5&quot;,&quot;F4A976E4967F8F4F621C87C67B9E258563F80F0E&quot;,&quot;B35BCF6C5C9DAEE7D0C756B666FFEDE2CF4659BA&quot;,&quot;B1BF8007527F85085D7C4A3DC406A9A6D124D721&quot;,&quot;E4E5673792DA616E14BEEF63F75DD96590124734&quot;,&quot;3FEBC1DE5DFBAF97B1F1CEEC80A1B192F999596A&quot;,&quot;CC852B5D1349041E1309AC5F9918ECE1FE5C023C&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))">
          - 				<return-response>
          - 					<set-status code="403" reason="Invalid client certificate." />
          - 				</return-response>
          - 			</when>
          - 		</choose>
          - 		<!-- generate totp -->
          - 		<set-variable name="client_id" value="api_gw" />
          - 		<set-variable name="client_secret" value="JBSAAHPPEHPK3PXP" />
          - 		<set-variable name="one_time_password" value="@{
          + <policies>
          +   <backend>
          +     <base/>
          +   </backend>
          +   <inbound>
          +     <base/>
          +     <choose>
          +       <when condition="@(context.Request.Headers[&quot;X-ARR-ClientCertThumbprint&quot;] == null)">
          +         <return-response>
          +           <set-status code="401" />
          +           <set-body>Missing client certificate</set-body>
          +         </return-response>
          +       </when>
          +       <when condition="@(!(new string[] {allowed_certificate_thumbprints}.Any(c => context.Request.Headers.ContainsKey(&quot;X-ARR-ClientCertThumbprint&quot;) && context.Request.Headers[&quot;X-ARR-ClientCertThumbprint&quot;].Contains(c))))">
          +         <return-response>
          +           <set-status code="401" />
          +           <set-body>Invalid client certificate</set-body>
          +         </return-response>
          +       </when>
          +     </choose>
          +     <!-- generate totp -->
          +     <set-variable name="client_id" value="api_gw" />
          +     <set-variable name="client_secret" value="JBSAAHPPEHPK3PXP" />
          +     <set-variable name="one_time_password" value="@{
                            const string Base32AllowedCharacters = &quot;ABCDEFGHIJKLMNOPQRSTUVWXYZ234567&quot;;
                            var bits = &quot;JBSAAHPPEHPK3PXP&quot;.ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                            var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
            
                            var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                            var timeIndex = unixTimestamp / 30;
                            byte[] challenge = BitConverter.GetBytes(timeIndex);
                            if (BitConverter.IsLittleEndian) {
                                Array.Reverse(challenge);
                            }
            
                            HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                            byte[] hash = hmac.ComputeHash(challenge);
                            int offset = hash[19] &amp; 0xf;
                            int truncatedHash = hash[offset] &amp; 0x7f;
                            for (int i = 1; i &lt; 4; i++)
                            {
                                truncatedHash &lt;&lt;= 8;
                                truncatedHash |= hash[offset + i] &amp; 0xff;
                            }
                            truncatedHash %= 1000000;
                            return truncatedHash.ToString(&quot;D6&quot;);
          -             }" />
          - 		<send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
          - 			<set-url>http://rpe-service-auth-provider-prod.service.core-compute-prod.internal/lease</set-url>
          - 			<set-method>POST</set-method>
          - 			<set-header name="Content-Type" exists-action="override">
          - 				<value>application/json</value>
          - 			</set-header>
          - 			<set-body>@{
          -         return new JObject(
          -         new JProperty("microservice", (string)context.Variables["client_id"]),
          -         new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
          -         ).ToString();
          -         }</set-body>
          - 		</send-request>
          - 		<set-header name="ServiceAuthorization" exists-action="override">
          - 			<value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As&lt;string&gt;())</value>
          - 		</set-header>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          +             }"/>
          +     <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
          +       <set-url>http://rpe-service-auth-provider-prod.service.core-compute-prod.internal/lease</set-url>
          +       <set-method>POST</set-method>
          +       <set-header name="Content-Type" exists-action="override">
          +         <value>application/json</value>
          +       </set-header>
          +       <set-body>@{
          +         return new JObject(
          +         new JProperty("microservice", (string)context.Variables["client_id"]),
          +         new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
          +         ).ToString();
          +         }</set-body>
          +     </send-request>
          + 
          +     <set-header name="ServiceAuthorization" exists-action="override">
          +       <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As&lt;string&gt;())</value>
          +     </set-header>
          +   </inbound>
          +   <outbound>
          +     <base/>
          +   </outbound>
          +   <on-error>
          +     <base/>
          +   </on-error>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

  # module.sdp_db_user[0].data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-prod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-prod-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-name/0d9f3329d1b646538368a22aa1a046d8" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" # forces replacement -> (known after apply) # forces replacement
        name                    = "ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-name"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-name/versions/0d9f3329d1b646538368a22aa1a046d8" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "0d9f3329d1b646538368a22aa1a046d8" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-password/49229c372eae47609bcaf6ba2bb3e1ec" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" # forces replacement -> (known after apply) # forces replacement
        name                    = "ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-password"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-password/versions/49229c372eae47609bcaf6ba2bb3e1ec" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "49229c372eae47609bcaf6ba2bb3e1ec" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/ccpay-bulkscanning-api-postgres-db-v15-prod-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":555,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->